; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	satellite4 - satellite
	instrument10 - instrument
	instrument11 - instrument
	satellite5 - satellite
	instrument12 - instrument
	instrument13 - instrument
	instrument14 - instrument
	infrared3 - mode
	spectrograph2 - mode
	thermograph0 - mode
	infrared1 - mode
	Star1 - direction
	GroundStation5 - direction
	Star0 - direction
	Star6 - direction
	GroundStation4 - direction
	Star3 - direction
	Star2 - direction
	Phenomenon7 - direction
	Star8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Star11 - direction
	Phenomenon12 - direction
	Planet13 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 infrared3)
	(calibration_target instrument0 Star6)
	(calibration_target instrument0 Star2)
	(supports instrument1 infrared3)
	(calibration_target instrument1 Star1)
	(supports instrument2 infrared1)
	(calibration_target instrument2 Star2)
	(calibration_target instrument2 Star3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet9)
	(supports instrument3 infrared3)
	(supports instrument3 thermograph0)
	(supports instrument3 infrared1)
	(calibration_target instrument3 GroundStation5)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon10)
	(supports instrument4 infrared3)
	(supports instrument4 infrared1)
	(calibration_target instrument4 Star6)
	(calibration_target instrument4 GroundStation4)
	(supports instrument5 spectrograph2)
	(supports instrument5 infrared1)
	(calibration_target instrument5 Star2)
	(calibration_target instrument5 Star0)
	(supports instrument6 infrared3)
	(calibration_target instrument6 GroundStation4)
	(calibration_target instrument6 Star2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star8)
	(supports instrument7 infrared3)
	(supports instrument7 spectrograph2)
	(supports instrument7 thermograph0)
	(calibration_target instrument7 Star1)
	(supports instrument8 infrared3)
	(supports instrument8 spectrograph2)
	(supports instrument8 thermograph0)
	(calibration_target instrument8 Star1)
	(supports instrument9 thermograph0)
	(calibration_target instrument9 Star6)
	(calibration_target instrument9 GroundStation4)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(on_board instrument9 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star11)
	(supports instrument10 infrared1)
	(supports instrument10 infrared3)
	(supports instrument10 spectrograph2)
	(calibration_target instrument10 GroundStation5)
	(calibration_target instrument10 GroundStation4)
	(supports instrument11 infrared1)
	(calibration_target instrument11 Star0)
	(on_board instrument10 satellite4)
	(on_board instrument11 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star8)
	(supports instrument12 spectrograph2)
	(calibration_target instrument12 GroundStation4)
	(calibration_target instrument12 Star6)
	(supports instrument13 thermograph0)
	(supports instrument13 spectrograph2)
	(calibration_target instrument13 Star3)
	(supports instrument14 thermograph0)
	(supports instrument14 infrared1)
	(calibration_target instrument14 Star2)
	(on_board instrument12 satellite5)
	(on_board instrument13 satellite5)
	(on_board instrument14 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Star3)
)
(:goal (and
	(pointing satellite2 GroundStation4)
	(have_image Phenomenon7 spectrograph2)
	(have_image Star8 infrared1)
	(have_image Planet9 infrared3)
	(have_image Phenomenon10 infrared3)
	(have_image Star11 infrared3)
	(have_image Phenomenon12 spectrograph2)
	(have_image Planet13 infrared1)
))

)

; plan
1. (turn_to satellite4 groundstation4 star8)
   deleted: (pointing satellite4 star8)
   added: (pointing satellite4 groundstation4)
   goals met: 0 of 8
2. (switch_on instrument10 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument10)
   goals met: 0 of 8
3. (calibrate satellite4 instrument10 groundstation4)
   added: (calibrated instrument10)
   goals met: 0 of 8
4. (turn_to satellite4 planet13 groundstation4)
   deleted: (pointing satellite4 groundstation4)
   added: (pointing satellite4 planet13)
   goals met: 0 of 8
5. (take_image satellite4 planet13 instrument10 infrared1)
   added: (have_image planet13 infrared1)
   goals met: 1 of 8
6. (turn_to satellite4 phenomenon7 planet13)
   deleted: (pointing satellite4 planet13)
   added: (pointing satellite4 phenomenon7)
   goals met: 1 of 8
7. (take_image satellite4 phenomenon7 instrument10 spectrograph2)
   added: (have_image phenomenon7 spectrograph2)
   goals met: 2 of 8
8. (turn_to satellite4 phenomenon12 phenomenon7)
   deleted: (pointing satellite4 phenomenon7)
   added: (pointing satellite4 phenomenon12)
   goals met: 2 of 8
9. (take_image satellite4 phenomenon12 instrument10 spectrograph2)
   added: (have_image phenomenon12 spectrograph2)
   goals met: 3 of 8
10. (turn_to satellite4 phenomenon10 phenomenon12)
   deleted: (pointing satellite4 phenomenon12)
   added: (pointing satellite4 phenomenon10)
   goals met: 3 of 8
11. (turn_to satellite2 groundstation4 star8)
   deleted: (pointing satellite2 star8)
   added: (pointing satellite2 groundstation4)
   goals met: 4 of 8
12. (take_image satellite4 phenomenon10 instrument10 infrared3)
   added: (have_image phenomenon10 infrared3)
   goals met: 5 of 8
13. (turn_to satellite4 planet9 phenomenon10)
   deleted: (pointing satellite4 phenomenon10)
   added: (pointing satellite4 planet9)
   goals met: 5 of 8
14. (take_image satellite4 planet9 instrument10 infrared3)
   added: (have_image planet9 infrared3)
   goals met: 6 of 8
15. (turn_to satellite4 star11 planet9)
   deleted: (pointing satellite4 planet9)
   added: (pointing satellite4 star11)
   goals met: 6 of 8
16. (take_image satellite4 star11 instrument10 infrared3)
   added: (have_image star11 infrared3)
   goals met: 7 of 8
17. (turn_to satellite4 star8 star11)
   deleted: (pointing satellite4 star11)
   added: (pointing satellite4 star8)
   goals met: 7 of 8
18. (take_image satellite4 star8 instrument10 infrared1)
   added: (have_image star8 infrared1)
   goals met: 8 of 8
